data/Parm_PH_29/alpha_10/alpha_10_12000_3036/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
15600
(
(0.0525329902561417 1.00196014084044 0)
(0.157501530229712 0.998444646758899 -1.81376046073723e-18)
(0.260950156279648 0.98242082620261 1.83785553110225e-18)
(0.359136353694278 0.946767577963651 5.46982936357774e-18)
(0.449733625522838 0.894077145291815 7.50076649880881e-18)
(0.534328369047149 0.831904978963652 9.34872490589978e-20)
(0.615544577447545 0.765347690227379 -1.10441748300937e-17)
(0.695561595869308 0.697377601774698 -3.43395146415465e-18)
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.052538030828719 1.00000464668192 0)
(0.157457571708034 0.996486198086277 0)
(0.260766568121779 0.980477179616037 0)
(0.358787033942751 0.944883603991789 0)
(0.449287647149667 0.892212689628735 0)
(0.533836442603869 0.829981273796805 0)
(0.615028617538822 0.76330798618755 0)
(0.695033381245503 0.695183993266097 0)
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.05 3.036 0)
(0.15 3.036 0)
(0.25 3.036 0)
(0.35 3.036 0)
(0.45 3.036 0)
(0.55 3.036 0)
(0.65 3.036 0)
(0.75 3.036 0)
...
)
;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }
    sideRight_half1
    {
        type            empty;
    }
    sideLeft_half0
    {
        type            empty;
    }
    sideLeft_half1
    {
        type            empty;
    }
}


// ************************************************************************* //
