data/Parm_PH_29/alpha_10/alpha_10_12000_3036/0/tauij_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      tauij_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor>
15600
(
(0.00348836 -0.00003576 0.00000000 0.00000350 0.00000000 0.00250688)
(0.00294842 0.00000072 0.00000000 -0.00003667 0.00000000 0.00167636)
(0.00019682 -0.00036471 0.00000000 0.00042048 0.00000000 0.00268531)
(0.00002367 -0.00036753 0.00000000 0.00030802 0.00000000 0.00046060)
(0.00419242 -0.00308305 0.00000000 0.00237429 0.00000000 0.00557689)
(0.00293302 -0.00209421 0.00000000 0.00153566 0.00000000 0.00359810)
(0.00122287 -0.00094650 0.00000000 0.00073724 0.00000000 0.00218690)
(0.00079150 -0.00069254 0.00000000 0.00060945 0.00000000 0.00236471)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
